; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-37)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 room3)
(at ball19 room3)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
(at ball35 room6)
(at ball36 room6)
(at ball37 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
(at ball35 roomb)
(at ball36 roomb)
(at ball37 roomb)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 8 of 37
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 8 of 37
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 37
4. (drop ball8 roomb right)
   deleted: (carry ball8 right)
   added: (at ball8 roomb) (free right)
   goals met: 9 of 37
5. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 10 of 37
6. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 10 of 37
7. (pick ball37 room6 left)
   deleted: (at ball37 room6) (free left)
   added: (carry ball37 left)
   goals met: 10 of 37
8. (pick ball36 room6 right)
   deleted: (at ball36 room6) (free right)
   added: (carry ball36 right)
   goals met: 10 of 37
9. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 10 of 37
10. (drop ball36 roomb right)
   deleted: (carry ball36 right)
   added: (at ball36 roomb) (free right)
   goals met: 11 of 37
11. (drop ball37 roomb left)
   deleted: (carry ball37 left)
   added: (at ball37 roomb) (free left)
   goals met: 12 of 37
12. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 12 of 37
13. (pick ball35 room6 left)
   deleted: (at ball35 room6) (free left)
   added: (carry ball35 left)
   goals met: 12 of 37
14. (pick ball34 room6 right)
   deleted: (at ball34 room6) (free right)
   added: (carry ball34 right)
   goals met: 12 of 37
15. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 12 of 37
16. (drop ball34 roomb right)
   deleted: (carry ball34 right)
   added: (at ball34 roomb) (free right)
   goals met: 13 of 37
17. (drop ball35 roomb left)
   deleted: (carry ball35 left)
   added: (at ball35 roomb) (free left)
   goals met: 14 of 37
18. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 14 of 37
19. (pick ball33 room6 left)
   deleted: (at ball33 room6) (free left)
   added: (carry ball33 left)
   goals met: 14 of 37
20. (pick ball32 room6 right)
   deleted: (at ball32 room6) (free right)
   added: (carry ball32 right)
   goals met: 14 of 37
21. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 14 of 37
22. (drop ball32 roomb right)
   deleted: (carry ball32 right)
   added: (at ball32 roomb) (free right)
   goals met: 15 of 37
23. (drop ball33 roomb left)
   deleted: (carry ball33 left)
   added: (at ball33 roomb) (free left)
   goals met: 16 of 37
24. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 16 of 37
25. (pick ball31 room5 left)
   deleted: (at ball31 room5) (free left)
   added: (carry ball31 left)
   goals met: 16 of 37
26. (pick ball30 room5 right)
   deleted: (at ball30 room5) (free right)
   added: (carry ball30 right)
   goals met: 16 of 37
27. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 16 of 37
28. (drop ball30 roomb right)
   deleted: (carry ball30 right)
   added: (at ball30 roomb) (free right)
   goals met: 17 of 37
29. (drop ball31 roomb left)
   deleted: (carry ball31 left)
   added: (at ball31 roomb) (free left)
   goals met: 18 of 37
30. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 18 of 37
31. (pick ball29 room5 left)
   deleted: (at ball29 room5) (free left)
   added: (carry ball29 left)
   goals met: 18 of 37
32. (pick ball28 room5 right)
   deleted: (at ball28 room5) (free right)
   added: (carry ball28 right)
   goals met: 18 of 37
33. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 18 of 37
34. (drop ball28 roomb right)
   deleted: (carry ball28 right)
   added: (at ball28 roomb) (free right)
   goals met: 19 of 37
35. (drop ball29 roomb left)
   deleted: (carry ball29 left)
   added: (at ball29 roomb) (free left)
   goals met: 20 of 37
36. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 20 of 37
37. (pick ball27 room5 left)
   deleted: (at ball27 room5) (free left)
   added: (carry ball27 left)
   goals met: 20 of 37
38. (pick ball26 room5 right)
   deleted: (at ball26 room5) (free right)
   added: (carry ball26 right)
   goals met: 20 of 37
39. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 20 of 37
40. (drop ball26 roomb right)
   deleted: (carry ball26 right)
   added: (at ball26 roomb) (free right)
   goals met: 21 of 37
41. (drop ball27 roomb left)
   deleted: (carry ball27 left)
   added: (at ball27 roomb) (free left)
   goals met: 22 of 37
42. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 22 of 37
43. (pick ball25 room5 left)
   deleted: (at ball25 room5) (free left)
   added: (carry ball25 left)
   goals met: 22 of 37
44. (pick ball24 room5 right)
   deleted: (at ball24 room5) (free right)
   added: (carry ball24 right)
   goals met: 22 of 37
45. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 22 of 37
46. (drop ball24 roomb right)
   deleted: (carry ball24 right)
   added: (at ball24 roomb) (free right)
   goals met: 23 of 37
47. (drop ball25 roomb left)
   deleted: (carry ball25 left)
   added: (at ball25 roomb) (free left)
   goals met: 24 of 37
48. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 24 of 37
49. (pick ball23 room4 left)
   deleted: (at ball23 room4) (free left)
   added: (carry ball23 left)
   goals met: 24 of 37
50. (pick ball22 room4 right)
   deleted: (at ball22 room4) (free right)
   added: (carry ball22 right)
   goals met: 24 of 37
51. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 24 of 37
52. (drop ball22 roomb right)
   deleted: (carry ball22 right)
   added: (at ball22 roomb) (free right)
   goals met: 25 of 37
53. (drop ball23 roomb left)
   deleted: (carry ball23 left)
   added: (at ball23 roomb) (free left)
   goals met: 26 of 37
54. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 26 of 37
55. (pick ball21 room4 left)
   deleted: (at ball21 room4) (free left)
   added: (carry ball21 left)
   goals met: 26 of 37
56. (pick ball20 room4 right)
   deleted: (at ball20 room4) (free right)
   added: (carry ball20 right)
   goals met: 26 of 37
57. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 26 of 37
58. (drop ball20 roomb right)
   deleted: (carry ball20 right)
   added: (at ball20 roomb) (free right)
   goals met: 27 of 37
59. (drop ball21 roomb left)
   deleted: (carry ball21 left)
   added: (at ball21 roomb) (free left)
   goals met: 28 of 37
60. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 28 of 37
61. (pick ball19 room3 left)
   deleted: (at ball19 room3) (free left)
   added: (carry ball19 left)
   goals met: 28 of 37
62. (pick ball18 room3 right)
   deleted: (at ball18 room3) (free right)
   added: (carry ball18 right)
   goals met: 28 of 37
63. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 28 of 37
64. (drop ball18 roomb right)
   deleted: (carry ball18 right)
   added: (at ball18 roomb) (free right)
   goals met: 29 of 37
65. (drop ball19 roomb left)
   deleted: (carry ball19 left)
   added: (at ball19 roomb) (free left)
   goals met: 30 of 37
66. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 30 of 37
67. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 30 of 37
68. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 30 of 37
69. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 37
70. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 31 of 37
71. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 32 of 37
72. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 32 of 37
73. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 32 of 37
74. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 32 of 37
75. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 32 of 37
76. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 33 of 37
77. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 34 of 37
78. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 34 of 37
79. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 34 of 37
80. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 34 of 37
81. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 34 of 37
82. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 35 of 37
83. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 36 of 37
84. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 36 of 37
85. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 36 of 37
86. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 36 of 37
87. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 37 of 37
